Revit 2027 API
ParameterTypeId.ProjectRevisionSequenceNum Property
 "Revision Sequence": read_only Make this read-only again when NewSchedules_DisplayTags is cleaned up
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ProjectRevisionSequenceNum { get; }
Public Shared ReadOnly Property ProjectRevisionSequenceNum As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ProjectRevisionSequenceNum {
	ForgeTypeId^ get ();
}
static member ProjectRevisionSequenceNum : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace